---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleFlippedDimLineExtension
source: html/1dfe4a1e-c45d-9b94-9dce-dce70e731aee.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleFlippedDimLineExtension Property

"Flipped Dimension Line Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleFlippedDimLineExtension { get; }
```